# Dérivation de caractéristiques à partir de variables de date et d'heure

Les variables de date et de temps  sont celles qui contiennent des informations sur les dates, les heures ou la date et l'heure. En programmation, nous appelons ces variables des variables datetime. Des exemples de variables datetime sont la date de naissance, l'heure de l'accident et la date du dernier paiement. Les variables datetime contiennent généralement une multitude d'étiquettes différentes correspondant à une combinaison spécifique de date et d'heure. Nous n'utilisons pas les variables datetime dans leur format brut lors de la création de modèles d'apprentissage automatique. Au lieu de cela, nous enrichissons considérablement l'ensemble de données en dérivant plusieurs caractéristiques de ces variables. Dans cet article, nous allons apprendre à dériver une variété de nouvelles fonctionnalités à partir de la date et de l'heure.

Cet article couvrira les recettes suivantes:
* Extraction de parties de date et d'heure à partir d'une variable datetime.
* Dérivation des représentations de l'année et du mois.
* Création de représentations du jour et de la semaine.
* Extraire des parties de temps à partir d'une variable de temps.
* Capturer le temps écoulé entre les variables datetime.
* Travailler avec le temps dans différents fuseaux horaires

## Extraction de parties de date et d'heure à partir de la variable datetime

Les variables datetime peuvent prendre des dates, l'heure ou la date et l'heure comme valeurs. Les variables datetime ne sont pas utilisées dans leur format brut pour créer des algorithmes d'apprentissage automatique. Au lieu de cela, nous créons des fonctionnalités supplémentaires à partir d'eux et, en fait, nous pouvons enrichir considérablement l'ensemble de données en extrayant des informations de la date et de l'heure.

La bibliothèque Python pandas contient de nombreuses fonctionnalités pour travailler avec la date et l'heure. Mais pour accéder à cette fonctionnalité, les variables doivent être converties dans un type de données prenant en charge ces opérations, telles que datetime ou timedelta. Souvent, les variables datetime sont des objets casts, en particulier lorsque les données sont chargées à partir d'un fichier CSV. Le dt des pandas, qui est l'objet accesseur aux propriétés datetime d'une série pandas, ne fonctionne qu'avec les types datetimedata ; par conséquent, pour extraire des parties de date et d'heure, et, en fait, pour dériver l'une des caractéristiques dont nous discuterons tout au long de ce chapitre, il est nécessaire de refondre les variables en datetime.

Dans cette recette, nous allons apprendre à séparer les parties date et heure d'une variable datetime à l'aide de pandas, et comment reformuler des objets en types de données datetime

Pour poursuivre la recette, commençons par importer pandas et créons un cadre de données pour la démonstration

In [1]:
import pandas as pd

Créons 20 valeurs datetime, avec des valeurs commençant à partir du 05/03/2019 à minuit suivies d'incréments de 1 minute. Ensuite, capturons la plage de valeurs dans un cadre de données et affichons les cinq premières lignes

In [2]:

# let's create a toy dataframe with some date variables

# first we create a series with the ranges
rng_ = pd.date_range('2019-03-05', periods=20, freq='T')

# now we convert the series in a dataframe
df = pd.DataFrame({'date': rng_}) 

# output the first 5 rows
df.head()

                 date
0 2019-03-05 00:00:00
1 2019-03-05 00:01:00
2 2019-03-05 00:02:00
3 2019-03-05 00:03:00
4 2019-03-05 00:04:00

Montrons le type de données de la variable que nous avons créée

In [3]:
# let's explore the variable type

df.dtypes

date    datetime64[ns]
dtype: object

Capturons la partie date de la variable de date dans une nouvelle fonctionnalité à l'aide du dt des pandas, puis affichons les cinq premières lignes

In [4]:
# let's extract the date part

df['date_part'] = df['date'].dt.date

df['date_part'].head()

0    2019-03-05
1    2019-03-05
2    2019-03-05
3    2019-03-05
4    2019-03-05
Name: date_part, dtype: object

Capturons maintenant la partie heure de la variable datetime à l'étape précédentedans une nouvelle fonctionnalité et affichons les premières lignes

In [5]:
# let's extract the time part

df['time_part'] = df['date'].dt.time

df['time_part'].head()

0    00:00:00
1    00:01:00
2    00:02:00
3    00:03:00
4    00:04:00
Name: time_part, dtype: object

Dans la deuxième partie de la recette, apprenons à changer le type de données d'une variable en une variable datetime.

Créons d'abord un nouveau dataframe où la variable datetime est convertie en objet et affichons la sortie

In [6]:

# let's create a toy dataframe where the datetime variable is cast
# as object

df = pd.DataFrame({'date_var':['Jan-2015', 'Apr-2013', 'Jun-2014', 'Jan-2015']})
df

   date_var
0  Jan-2015
1  Apr-2013
2  Jun-2014
3  Jan-2015

In [7]:
# let's explore the variable type

df.dtypes

date_var    object
dtype: object

Modifions le type de données de la variable en datetime et affichons le dataframe

In [8]:

# let's re-cast the variable as datetime

df['datetime_var'] = pd.to_datetime(df['date_var'])
df

   date_var datetime_var
0  Jan-2015   2015-01-01
1  Apr-2013   2013-04-01
2  Jun-2014   2014-06-01
3  Jan-2015   2015-01-01

In [9]:
# let's extract date and time

df['date'] = df['datetime_var'].dt.date
df['time'] = df['datetime_var'].dt.time

df

   date_var datetime_var        date      time
0  Jan-2015   2015-01-01  2015-01-01  00:00:00
1  Apr-2013   2013-04-01  2013-04-01  00:00:00
2  Jun-2014   2014-06-01  2014-06-01  00:00:00
3  Jan-2015   2015-01-01  2015-01-01  00:00:00

In [10]:
# let's explore the variable types

df.dtypes

date_var                object
datetime_var    datetime64[ns]
date                    object
time                    object
dtype: object

## Dérivation des représentations de l'année et du mois

Certains événements se produisent plus souvent à certaines périodes de l'année, par exemple, les taux de recrutement augmentent après Noël et ralentissent vers les vacances d'été en Europe. Les entreprises et les organisations souhaitent évaluer les performances et les objectifs à intervalles réguliers tout au long de l'année, par exemple tous les trimestres. ou chaque semestre. Par conséquent, dériver ces caractéristiques d'une variable de date est très utile à la fois pour l'analyse des données et l'apprentissage automatique. Dans cette recette, nous allons apprendre à dériver l'année, le mois, le trimestre et le semestre à partir d'une variable datetime en utilisant pandas et NumPy

In [11]:
import numpy as np
import pandas as pd

In [12]:
# let's create a toy dataframe with a date variable which values
# increase 1 month at a time

rng_ = pd.date_range('2019-03-05', periods=20, freq='M')
df = pd.DataFrame({'date': rng_}) 
df.head()

        date
0 2019-03-31
1 2019-04-30
2 2019-05-31
3 2019-06-30
4 2019-07-31

In [13]:
# extract year

df['year'] = df['date'].dt.year

df.head()

        date  year
0 2019-03-31  2019
1 2019-04-30  2019
2 2019-05-31  2019
3 2019-06-30  2019
4 2019-07-31  2019

In [14]:
# extract month

df['month'] = df['date'].dt.month

df.head()

        date  year  month
0 2019-03-31  2019      3
1 2019-04-30  2019      4
2 2019-05-31  2019      5
3 2019-06-30  2019      6
4 2019-07-31  2019      7

In [15]:
# extract quarter

df['quarter'] = df['date'].dt.quarter

df.head()

        date  year  month  quarter
0 2019-03-31  2019      3        1
1 2019-04-30  2019      4        2
2 2019-05-31  2019      5        2
3 2019-06-30  2019      6        2
4 2019-07-31  2019      7        3

Enfin, capturons le semestre correspondant dans une nouvelle colonne et affichons les premières lignes du cadre de données

In [16]:
# extract semester

df['semester'] = np.where(df['quarter'].isin([1,2]), 1,2)

df.head()

        date  year  month  quarter  semester
0 2019-03-31  2019      3        1         1
1 2019-04-30  2019      4        2         1
2 2019-05-31  2019      5        2         1
3 2019-06-30  2019      6        2         1
4 2019-07-31  2019      7        3         2

## Création de représentations du jour et de la semaine

Certains événements se produisent plus souvent certains jours de la semaine, par exemple, les demandes de prêt se produisent plus souvent pendant la semaine que le week-end, tandis que d'autres surviennent plus souvent certaines semaines de l'année. Les entreprises et les organisations peuvent également vouloir suivre certaines mesures de performance clés tout au long de la semaine. Par conséquent, la dérivation des semaines et des jours à partir d'une variable date est très utile pour aider les organisations à atteindre leurs objectifs, et elles peuvent également être prédictives dans l'apprentissage automatique. Dans cette recette, nous allons apprendre à dériver différentes représentations des jours et des semaines à partir d'une variable datetime en utilisant pandas et NumPy.

In [23]:

# let's create a toy dataframe with a date variables which values
# increase by 1 day

rng_ = pd.date_range('2019-03-05', periods=20, freq='D')
df = pd.DataFrame({'date': rng_}) 
df.head()

        date
0 2019-03-05
1 2019-03-06
2 2019-03-07
3 2019-03-08
4 2019-03-09

Extrayons le jour du mois, qui peut prendre des valeurs comprises entre 1 et 31, et saisissons-le dans une nouvelle colonne. Ensuite, affichons les premières lignes du dataframe

In [24]:
# extract day of the month - with possible values 1 to 31

df['day_mo'] = df['date'].dt.day

df.head()

        date  day_mo
0 2019-03-05       5
1 2019-03-06       6
2 2019-03-07       7
3 2019-03-08       8
4 2019-03-09       9

Extrayons le jour de la semaine, avec des valeurs comprises entre 0 et 6, dans une nouvelle colonne, puis affichons les premières lignes

In [25]:

# extract day of the week - with possible values 0-6

df['day_week'] = df['date'].dt.dayofweek

df.head()

        date  day_mo  day_week
0 2019-03-05       5         1
1 2019-03-06       6         2
2 2019-03-07       7         3
3 2019-03-08       8         4
4 2019-03-09       9         5

In [20]:
df['day_week'].unique()

array([1, 2, 3, 4, 5, 6, 0])

Maintenant, extrayons le nom du jour de la semaine, c'est-à-dire lundi, mardi, et ainsi de suite, dans une nouvelle colonne et sortons les cinq premières lignes de la trame de données

In [28]:

# extract name of day of the week 
df['day_week_name'] = df['date'].dt.day_name()

df.head()

        date  day_mo  day_week day_week_name
0 2019-03-05       5         1       Tuesday
1 2019-03-06       6         2     Wednesday
2 2019-03-07       7         3      Thursday
3 2019-03-08       8         4        Friday
4 2019-03-09       9         5      Saturday

Ensuite, créons une variable binaire qui indique si la date était un week-end, puis affichons les premières lignes du cadre de données

In [29]:
# is it weekend?

df['is_weekend'] = np.where(df['day_week_name'].isin(['Sunday', 'Saturday']), 1,0)

df.head()

        date  day_mo  day_week day_week_name  is_weekend
0 2019-03-05       5         1       Tuesday           0
1 2019-03-06       6         2     Wednesday           0
2 2019-03-07       7         3      Thursday           0
3 2019-03-08       8         4        Friday           0
4 2019-03-09       9         5      Saturday           1

Enfin, capturons la semaine correspondante de l'année, qui peut prendre des valeurs de 1 à 52, et affichons les premières lignes du dataframe

In [30]:
# Extract week of year from date, with possible values from 1 to 52

df['week'] = df['date'].dt.week

df.head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  This is separate from the ipykernel package so we can avoid doing imports until

        date  day_mo  day_week day_week_name  is_weekend  week
0 2019-03-05       5         1       Tuesday           0    10
1 2019-03-06       6         2     Wednesday           0    10
2 2019-03-07       7         3      Thursday           0    10
3 2019-03-08       8         4        Friday           0    10
4 2019-03-09       9         5      Saturday           1    10

## Extraire des parties de temps à partir d'une variable datetime.

Certains événements se produisent plus souvent à certains moments de la journée, par exemple, les activités frauduleuses se produisent plus probablement pendant la nuit ou tôt le matin. De plus, occasionnellement, les organisations souhaitent savoir si un événement s'est produit après un autre, dans un laps de temps très court, par exemple, si les ventes ont augmenté grâce à l'affichage d'une publicité télévisée ou en ligne. Par conséquent, la dérivation de fonctionnalités temporelles est extrêmement utile. Dans cette recette, nous allons extraire différentes parties d'une variable datetime en utilisant pandas et NumPy

In [31]:
# let's create a toy dataframe with some date variables

rng_ = pd.date_range('2019-03-05', periods=20, freq='1h15min10s')
df = pd.DataFrame({'date': rng_}) 
df.head()

                 date
0 2019-03-05 00:00:00
1 2019-03-05 01:15:10
2 2019-03-05 02:30:20
3 2019-03-05 03:45:30
4 2019-03-05 05:00:40


Extrayons les heures, les minutes et les secondes de l'heure dans trois nouvelles colonnes, puis affichons les cinq premières lignes du cadre de données

In [32]:
# extract hr, min and sec

df['hour'] = df['date'].dt.hour
df['min'] = df['date'].dt.minute
df['sec'] = df['date'].dt.second

df.head()

                 date  hour  min  sec
0 2019-03-05 00:00:00     0    0    0
1 2019-03-05 01:15:10     1   15   10
2 2019-03-05 02:30:20     2   30   20
3 2019-03-05 03:45:30     3   45   30
4 2019-03-05 05:00:40     5    0   40

Effectuons les mêmes opérations que nous avons faites à l'étape précidente mais maintenant dans une ligne de code

In [33]:

# the same in one line

df[['h','m','s']] = pd.DataFrame([(x.hour, x.minute, x.second) for x in df['date']])

df.head()

                 date  hour  min  sec  h   m   s
0 2019-03-05 00:00:00     0    0    0  0   0   0
1 2019-03-05 01:15:10     1   15   10  1  15  10
2 2019-03-05 02:30:20     2   30   20  2  30  20
3 2019-03-05 03:45:30     3   45   30  3  45  30
4 2019-03-05 05:00:40     5    0   40  5   0  40

In [34]:
df['hour'].unique()

array([ 0,  1,  2,  3,  5,  6,  7,  8, 10, 11, 12, 13, 15, 16, 17, 18, 20,
       21, 22, 23])

Enfin, créons une variable binaire qui signale si l'événement s'est produit le matin, entre 6 heures du matin. et 12h

In [35]:
# is it morning?

df['is_morning'] = np.where( (df['hour'] < 12) & (df['hour'] > 6), 1, 0 )

df.head()

                 date  hour  min  sec  h   m   s  is_morning
0 2019-03-05 00:00:00     0    0    0  0   0   0           0
1 2019-03-05 01:15:10     1   15   10  1  15  10           0
2 2019-03-05 02:30:20     2   30   20  2  30  20           0
3 2019-03-05 03:45:30     3   45   30  3  45  30           0
4 2019-03-05 05:00:40     5    0   40  5   0  40           0

## Capturer le temps écoulé entre les variables datetime

Les variables datetime offrent une valeur individuellement et elles offrent plus de valeur collectivement lorsqu'elles sont utilisées avec d'autres variables datetime pour obtenir des informations importantes. L'exemple le plus courant consiste à dériver l'âge à partir de la date de naissance et today variable, ou le jour où le client a eu un accident ou a demandé un prêt. Comme ces exemples, nous pouvons combiner plusieurs variables datetime pour dériver le temps qui s'est écoulé entre les deux et créer des fonctionnalités plus significatives. Dans cette recette, nous allons apprendre à capturer le temps entre deux variables datetime dans différents formats et le temps entre une variable datetime et le jour actuel, en utilisant pandas, NumPy et la bibliothèque datetime.

In [36]:
import datetime
import numpy as np
import pandas as pd

In [37]:
# let's create a toy dataframe with some date variables

rng_hr = pd.date_range('2019-03-05', periods=20, freq='H')
rng_month = pd.date_range('2019-03-05', periods=20, freq='M')

df = pd.DataFrame({'date1': rng_hr, 'date2': rng_month}) 
df.head()

                date1      date2
0 2019-03-05 00:00:00 2019-03-31
1 2019-03-05 01:00:00 2019-04-30
2 2019-03-05 02:00:00 2019-05-31
3 2019-03-05 03:00:00 2019-06-30
4 2019-03-05 04:00:00 2019-07-31

Capturons la différence en jours entre les deux variables dans une nouvelle fonctionnalité, puis affichons les premières lignes de la base de données

In [38]:
# let's capture the difference in days between the 2 variables

df['elapsed_days'] = (df['date2'] - df['date1']).dt.days

df.head()

                date1      date2  elapsed_days
0 2019-03-05 00:00:00 2019-03-31            26
1 2019-03-05 01:00:00 2019-04-30            55
2 2019-03-05 02:00:00 2019-05-31            86
3 2019-03-05 03:00:00 2019-06-30           116
4 2019-03-05 04:00:00 2019-07-31           147

In [ ]:
Capturons la différence en mois entre les deux variables datetime dans une nouvelle fonctionnalité, puis affichons les premières lignes du dataframe

In [39]:
# let's capture the difference in months between the 2 variables

df['months_passed'] = ((df['date2'] - df['date1']) / np.timedelta64(1, 'M'))
df['months_passed'] = np.round(df['months_passed'],0)

df.head()

                date1      date2  elapsed_days  months_passed
0 2019-03-05 00:00:00 2019-03-31            26            1.0
1 2019-03-05 01:00:00 2019-04-30            55            2.0
2 2019-03-05 02:00:00 2019-05-31            86            3.0
3 2019-03-05 03:00:00 2019-06-30           116            4.0
4 2019-03-05 04:00:00 2019-07-31           147            5.0

Maintenant, calculons le temps entre les variables en minutes et secondes et puis affichons les premières lignes du cadre de données

In [43]:

# calculate difference in seconds and minutes

df['diff_seconds'] = (df['date2'] - df['date1'])/np.timedelta64(1,'s')
df['diff_minutes'] = (df['date2'] - df['date1'])/np.timedelta64(1,'m')

df.head()

                date1      date2  ...  diff_seconds  diff_minutes
0 2019-03-05 00:00:00 2019-03-31  ...     2246400.0       37440.0
1 2019-03-05 01:00:00 2019-04-30  ...     4834800.0       80580.0
2 2019-03-05 02:00:00 2019-05-31  ...     7509600.0      125160.0
3 2019-03-05 03:00:00 2019-06-30  ...    10098000.0      168300.0
4 2019-03-05 04:00:00 2019-07-31  ...    12772800.0      212880.0

[5 rows x 6 columns]

Enfin, calculons la différence entre une variable et le jour en cours, puis affichons les 5 premières lignes du dataframe

In [44]:

# calculate difference to today

df['to_today'] = (datetime.datetime.today() - df['date1'])

df.head()

                date1      date2  ...  diff_minutes                 to_today
0 2019-03-05 00:00:00 2019-03-31  ...       37440.0 909 days 15:23:17.496633
1 2019-03-05 01:00:00 2019-04-30  ...       80580.0 909 days 14:23:17.496633
2 2019-03-05 02:00:00 2019-05-31  ...      125160.0 909 days 13:23:17.496633
3 2019-03-05 03:00:00 2019-06-30  ...      168300.0 909 days 12:23:17.496633
4 2019-03-05 04:00:00 2019-07-31  ...      212880.0 909 days 11:23:17.496633

[5 rows x 7 columns]

## Travailler avec le temps dans différents fuseaux horaires.

Certaines organisations opèrent à l'échelle internationale ; par conséquent, les informations qu'ils collectent sur les événements peuvent être enregistrées avec le fuseau horaire de la zone où l'événement a eu lieu. Pour pouvoir comparer les événements qui se sont produits dans différents fuseaux horaires, nous devons d'abord définir toutes les variables dans le même fuseau. Dans cette recette, nous allons apprendre à unifier les fuseaux horaires d'une variable datetime puis apprendre à réaffecter une variable à un autre fuseau horaire à l'aide de pandas

Pour poursuivre la recette, importons pandas, puis créons une base de données avec deux variables, chacune contenant une date et une heure dans différents fuseaux horaires

In [45]:
# first, let's create a toy dataframe with some timestamps in different time zones
# variable 1

df = pd.DataFrame()

df['time1'] = pd.concat([
    pd.Series(
        pd.date_range(
            start='2015-06-10 09:00', freq='H', periods=3,
            tz='Europe/Berlin')),
    pd.Series(
        pd.date_range(
            start='2015-09-10 09:00', freq='H', periods=3, tz='US/Central'))
    ], axis=0)

df

                       time1
0  2015-06-10 09:00:00+02:00
1  2015-06-10 10:00:00+02:00
2  2015-06-10 11:00:00+02:00
0  2015-09-10 09:00:00-05:00
1  2015-09-10 10:00:00-05:00
2  2015-09-10 11:00:00-05:00

Maintenant, ajoutons une autre variable datetime au dataframe, qui contient également des valeurs dans différents fuseaux horaires, puis affichons le dataframe résultant

In [46]:
# first, let's create a toy dataframe with some timestamps in different time zones
# variable 2

df['time2'] = pd.concat([
    pd.Series(
        pd.date_range(
            start='2015-07-01 09:00', freq='H', periods=3,
            tz='Europe/Berlin')),
    pd.Series(
        pd.date_range(
            start='2015-08-01 09:00', freq='H', periods=3, tz='US/Central'))
    ], axis=0)

df

                       time1                      time2
0  2015-06-10 09:00:00+02:00  2015-07-01 09:00:00+02:00
1  2015-06-10 10:00:00+02:00  2015-07-01 10:00:00+02:00
2  2015-06-10 11:00:00+02:00  2015-07-01 11:00:00+02:00
0  2015-09-10 09:00:00-05:00  2015-08-01 09:00:00-05:00
1  2015-09-10 10:00:00-05:00  2015-08-01 10:00:00-05:00
2  2015-09-10 11:00:00-05:00  2015-08-01 11:00:00-05:00

Pour travailler avec différents fuseaux horaires, tout d'abord, nous unifions le fuseau horaire avec le réglage du fuseau central, utc = True :

In [47]:
# to work with different time zones, first we unify the timezone to the central one
# setting utc = True

df['time1_utc'] = pd.to_datetime(df['time1'], utc=True)
df['time2_utc'] = pd.to_datetime(df['time2'], utc=True)

df

                       time1  ...                 time2_utc
0  2015-06-10 09:00:00+02:00  ... 2015-07-01 07:00:00+00:00
1  2015-06-10 10:00:00+02:00  ... 2015-07-01 08:00:00+00:00
2  2015-06-10 11:00:00+02:00  ... 2015-07-01 09:00:00+00:00
0  2015-09-10 09:00:00-05:00  ... 2015-08-01 14:00:00+00:00
1  2015-09-10 10:00:00-05:00  ... 2015-08-01 15:00:00+00:00
2  2015-09-10 11:00:00-05:00  ... 2015-08-01 16:00:00+00:00

[6 rows x 4 columns]

Maintenant, calculons la différence en jours entre les variables, puis affichons le dataframe

In [48]:
# let's explore the variable type

df['elapsed_days'] = (df['time2_utc'] - df['time1_utc']).dt.days

# Nous pouvons voir le temps entre les valeurs des variables dans la trame de données dans la sortie suivante

df['elapsed_days'].head()

0    21
1    21
2    21
0   -40
1   -40
Name: elapsed_days, dtype: int64

Enfin, changeons le fuseau horaire des variables datetime en d'autres et affichons les nouvelles variables

In [49]:
# next we change all timestamps to the desired timezone, eg Europe/London
# in this example

df['time1_london'] = df['time1_utc'].dt.tz_convert('Europe/London')
df['time2_berlin'] = df['time1_utc'].dt.tz_convert('Europe/Berlin')

df[['time1_london', 'time2_berlin']]

               time1_london              time2_berlin
0 2015-06-10 08:00:00+01:00 2015-06-10 09:00:00+02:00
1 2015-06-10 09:00:00+01:00 2015-06-10 10:00:00+02:00
2 2015-06-10 10:00:00+01:00 2015-06-10 11:00:00+02:00
0 2015-09-10 15:00:00+01:00 2015-09-10 16:00:00+02:00
1 2015-09-10 16:00:00+01:00 2015-09-10 17:00:00+02:00
2 2015-09-10 17:00:00+01:00 2015-09-10 18:00:00+02:00